In [51]:
import pandas as pd
import numpy as np

In [52]:
data = pd.read_csv("weight-height.csv")

In [53]:
data.head(10)

  Gender     Height      Weight
0   Male  73.847017  241.893563
1   Male  68.781904  162.310473
2   Male  74.110105  212.740856
3   Male  71.730978  220.042470
4   Male  69.881796  206.349801
5   Male  67.253016  152.212156
6   Male  68.785081  183.927889
7   Male  68.348516  167.971110
8   Male  67.018950  175.929440
9   Male  63.456494  156.399676

In [54]:
type(data)

pandas.core.frame.DataFrame

In [55]:
type(data.loc[0,"Weight"])

numpy.float64

In [56]:
data["Sorted_Weight"] = np.sort(data["Weight"])

In [57]:
data.head()

  Gender     Height      Weight  Sorted_Weight
0   Male  73.847017  241.893563      64.700127
1   Male  68.781904  162.310473      68.982530
2   Male  74.110105  212.740856      71.393749
3   Male  71.730978  220.042470      72.750145
4   Male  69.881796  206.349801      77.523774

In [64]:
data.tail()

      Gender     Height      Weight  Sorted_Weight
9995  Female  66.172652  136.777454     253.889004
9996  Female  67.067155  170.867906     254.209073
9997  Female  63.867992  128.475319     255.690835
9998  Female  69.034243  163.852461     255.863326
9999  Female  61.944246  113.649103     269.989699

In [58]:
data.loc[:,"Sorted_Weight"].describe()

count    10000.000000
mean       161.440357
std         32.108439
min         64.700127
25%        135.818051
50%        161.212928
75%        187.169525
max        269.989699
Name: Sorted_Weight, dtype: float64

In [59]:
Q1 = data.loc[:,"Sorted_Weight"].quantile(0.25)
Q1

135.8180513055015

In [60]:
Q3 = data.loc[:,"Sorted_Weight"].quantile(0.75)
Q3

187.16952486868348

In [61]:
IQR = Q3-Q1
IQR

51.35147356318197

In [62]:
lower_limit = Q1 - 1.5*IQR
upper_limit = Q3 + 1.5*IQR
print(f"Upper limit: {upper_limit}. Lower limit: {lower_limit}")

Upper limit: 264.19673521345646. Lower limit: 58.79084096072856

In [63]:
data_filtered = data[(data["Sorted_Weight"]<upper_limit) & (data["Sorted_Weight"] > lower_limit)]

print(data_filtered)

      Gender     Height      Weight  Sorted_Weight
0       Male  73.847017  241.893563      64.700127
1       Male  68.781904  162.310473      68.982530
2       Male  74.110105  212.740856      71.393749
3       Male  71.730978  220.042470      72.750145
4       Male  69.881796  206.349801      77.523774
...      ...        ...         ...            ...
9994  Female  59.098250  110.529686     252.556689
9995  Female  66.172652  136.777454     253.889004
9996  Female  67.067155  170.867906     254.209073
9997  Female  63.867992  128.475319     255.690835
9998  Female  69.034243  163.852461     255.863326

[9999 rows x 4 columns]

In [67]:
data[(data["Sorted_Weight"]>upper_limit)  |  (data["Sorted_Weight"] < lower_limit)]

# Outlier in the data set

      Gender     Height      Weight  Sorted_Weight
9999  Female  61.944246  113.649103     269.989699